#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @File  : cp3_1_1.py
# @Author: WRH
# @Date  : 2021/2/5
# @Edition:Python3.8.6

'''
第3章  Python程序的基本流程控制
本章教学目标：
了解计算思维和程序设计基本方法；
理解并掌握程序设计的三种基本结构；
熟练运用三种结构解决各种顺序、选择及重复执行的问题；
初步掌握程序的调试方法。
'''

# 计算思维和程序设计基本方法

# 计算思维（Computational Thinking,CT）
'''
1.人类的科学思维主要包括：实证思维、逻辑思维和计算思维
2.计算思维由美国科学家周以真（Jeannette M.Wing)在2016年提出
3.计算思维主要通过抽象、转化、仿真、迭代等方法，把一个复杂困难的现实问题转化为一个人类知道的，可以利用计算机自动解决的问题
4.计算思维的语义必须是确定性的，不能出现二义性；
  计算思维的结论是必须是有限的，在计算机中不允许出现数学中趋于无穷性的解；
  计算思维的执行方式必须是机械的，可以通过具体步骤来实现
5.计算思维的本质是抽象和自动化
6.计算思维是人的思想和方法，而不是计算机的思维方式
'''

# 程序设计基本方法
'''
1.程序设计遵循的基本模式为IPO（Input、Process、Output）
2.程序设计方法主要包括：
  面向过程的结构化设计方法
  面向对象的程序设计方法 # 第七章讲述
3.结构化设计方法的三种基本结构：顺序结构、分支结构及循环结构
4.结构化设计往往采用自上而下的设计方法，先做顶层设计，然后将复杂问题进行分解，转化为若干个可独立解决的简单的子问题 “分而治之”
'''